app/controllers/admin/jobs_controller.rb

INSERT INTO "job_plumbers" ("job_id", "plumber_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["job_id", 10], ["plumber_id", 3], ["created_at", "2022-10-22 15:24:32.392568"], ["updated_at", "2022-10-22 15:24:32.392568"]]
---
    def new
      @job = Job.new
      @job.job_plumbers << JobPlumber.new